app/channels/room_channel.rb

  def unsubscribed
    # Any cleanup needed when channel is unsubscribed
    @room.room_members.find_by(user_id: @user.id).destroy
---
SELECT "user_id" FROM "rooms" WHERE 1=0 AND 1=0