app/channels/room_channel.rb

  def subscribed
    #stream_from "room_channel"
    @room = Room.find(params[:id])
    @user = User.find(params[:user_id])
    if @room != nil
      stream_for @room
      #同じユーザーがかぶって居たらcreateしない
      hash = RoomMember.group(:@user_id).having('count(*) >= 2').maximum(:created_at)
      user_ids = RoomMember.where(user_id: hash.keys, created_at: hash.values).pluck(:@user_id)
      RoomMember.where(user_id: @user.id).where.not(id: user_ids).destroy_all
      @room.room_members.create! user_id: @user.id

      RoomChannel.broadcast_to @room, memberNum: @room.room_members.count
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "room_members".* FROM "room_members" WHERE "room_members"."room_id" = ? AND "room_members"."user_id" = ? LIMIT ?  [["room_id", 1], ["user_id", 2], ["LIMIT", 1]]
SELECT MAX("room_members"."created_at") AS maximum_created_at, "@user_id" AS user_id FROM "room_members" GROUP BY "@user_id" HAVING (count(*) >= 2)
SELECT "@user_id" FROM "room_members" WHERE 1=0 AND 1=0
DELETE FROM "room_members" WHERE "room_members"."id" = ?  [["id", 92]]
SELECT "@user_id" FROM "room_members" WHERE "room_members"."user_id" = ? AND "room_members"."created_at" = ?  [["user_id", 0], ["created_at", "2021-05-18 16:59:39.091333"]]
INSERT INTO "room_members" ("room_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["room_id", 1], ["user_id", 2], ["created_at", "2021-05-18 17:10:39.066108"], ["updated_at", "2021-05-18 17:10:39.066108"]]
SELECT COUNT(*) FROM "room_members" WHERE "room_members"."room_id" = ?  [["room_id", 1]]

  def unsubscribed
    # Any cleanup needed when channel is unsubscribed


    RoomMember.where(user_id: @user.id).destroy_all

    @room.room_members.create! user_id: @user.id

    RoomChannel.broadcast_to @room, memberNum: @room.room_members.count
---
DELETE FROM "room_members" WHERE "room_members"."id" = ?  [["id", 19]]
SELECT  "room_members".* FROM "room_members" WHERE "room_members"."room_id" = ? AND "room_members"."user_id" = ? LIMIT ?  [["room_id", 1], ["user_id", 2], ["LIMIT", 1]]
INSERT INTO "room_members" ("room_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["room_id", 1], ["user_id", 2], ["created_at", "2021-05-18 16:22:37.021875"], ["updated_at", "2021-05-18 16:22:37.021875"]]
SELECT COUNT(*) FROM "room_members" WHERE "room_members"."room_id" = ?  [["room_id", 1]]

  def sync(data)
    room = Room.find(data['room_id'])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def speak(data)
    room = Room.find(data['room_id'])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def movie_create(data)
    p "テスト"
    p data
    room = Room.find(data['room_id'])
    MovieUrl.create! playlist_id: room.playlist_id, url: data["url"],user_id: data["user_id"]
---
INSERT INTO "movie_urls" ("url", "playlist_id", "title", "user_id", "created_at", "updated_at", "ytid") VALUES (?, ?, ?, ?, ?, ?, ?)