app/views/rooms/show.html.erb

SELECT COUNT(*) FROM "room_members" WHERE "room_members"."room_id" = ?  [["room_id", 1]]
---
          <div class = "glyphicon glyphicon-eye-open" ></div>
          <span id = "memberNum" data-memberNum="<%= @room.room_members.count %>"> <%= @room.room_members.count %> 人</span>

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "movie_urls".* FROM "movie_urls" WHERE "movie_urls"."playlist_id" = ?  [["playlist_id", 1]]
---
    <ul id="playlist" class="clearfix horizontal-list">
      <% @room.playlist.movie_urls.each do |movie_url| %>