app/controllers/playlists_controller.rb

SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = ?  [["user_id", 1]]
---
  def index
    @playlists = Playlist.where(user_id: current_user.id)

INSERT INTO "movie_urls" ("url", "playlist_id", "title", "description", "user_id", "created_at", "updated_at", "ytid") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "playlists" ("name", "user_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "aaa"], ["user_id", 1], ["description", "aaa"], ["created_at", "2019-01-22 12:47:19.872204"], ["updated_at", "2019-01-22 12:47:19.872204"]]
---
  def create
    @playlist = Playlist.new(playlist_params)
    @playlist.user_id = current_user.id
    @playlist.movie_urls.each do |movie_url|
      movie_url.user_id = current_user.id
      movie_url.ytid = url_to_ytid(movie_url.url)
      if movie_url.title == ""
        movie_url.title = get_title(movie_url.ytid)
      end
    end
    #renderとridirectを分ける
    if @playlist.save

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @playlist = Playlist.find(params[:id])