app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms"
---
  def index
    @rooms = Room.all

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @room = Room.new
    @playlist = Playlist.find_by(id: current_user.id)

INSERT INTO "rooms" ("name", "playlist_id", "admin_user_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "aaa"], ["playlist_id", 1], ["admin_user_id", 1], ["description", "aaa"], ["created_at", "2019-01-22 12:47:32.784795"], ["updated_at", "2019-01-22 12:47:32.784795"]]
---
  def create
    @room = Room.new(room_params)
    #外すと動く・・・
    #@room.playlist = Playlist.find(params[:room][:playlist_id])
    if @room.save

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @room = Room.find(params[:id])