app/views/playlists/show.html.erb

<p>説明： <%= @playlist.description %> </p>
<% @playlist.movie_urls.each do |movie_url| %>
---
SELECT "movie_urls".* FROM "movie_urls" WHERE "movie_urls"."playlist_id" = ?  [["playlist_id", 3]]